bricks/olymp/olymp/arhimed/2013.org
#+HTML_DOCTYPE: html5
#+OPTIONS: toc:nil num:nil html5-fancy:t
#+MACRO: begin-block #+HTML: <div class="$1">
#+MACRO: end-block #+HTML: </div>

{{{begin-block(Page)}}}






* Турнир Архимеда 2013 в Кирове

*28 апреля 2013 года* состоится Турнир Архимеда - международная
командная олимпиада по программированию для начинающих. Это командное
соревнование, которое проводится в один компьютерный тур
продолжительностью 3 часа. Команде из трёх человек предоставляется
один персональный компьютер и предлагается решить 8-12 задач. Для
решения задач участники могут использовать следующие языки
программирования: C/C++, C#, Java, Pascal, Python.

** Правила олимпиады

Турнир проходит по правилам написанным на [[http://arhimedes.org/index.php?id%3Dinformatics][официальном сайте]]. Основные моменты:

+ команде предоставляется компьютер с установленными средами и
  компиляторами, а также с доступом к проверяющей системе, условия
  нескольких задач и три часа времени
+ решение задачи - программа на одном из разрешённых языков
  программирования
+ решения проверяются автоматически
+ побеждает команда, решившая больше всего задач
+ во время тура участники взаимодействуют только со своей командой и с
  жюри
+ разрешается использовать любую литературу
+ не разрешается использовать технику, за исключением предоставляемого
  компьютера

** Результаты

Турнир Архимеда 2013 в Кирове состоялся. Cпасибо всем за участие. Наши результаты:

|-----+---------------------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----+-----+--------+-------+-------|
|     | Команда                                                             | A   | B   | C   | D   | E   | F   | G   | H   | Задачи | Баллы | Место |
|-----+---------------------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----+-----+--------+-------+-------|
| <r> | <l>                                                                 | <c> | <c> | <c> | <c> | <c> | <c> | <c> | <c> | <c>    | <c>   | <c>   |
| 018 | Школа №28 #4 (Черемисинова 9, Голощапова 9)                         | +   | +   | -4  |     | +   | -2  | -3  |     | 3      | 138   | 1     |
| 005 | ЦДООШ + Школа №10, "Вадим и К.О." (Радаев 9, Пиксаев 9, Щербаков 9) | +   | +3  |     |     | +1  | -7  |     |     | 3      | 308   | 2     |
| 001 | КЭПЛ #1 (Фролова 10, Кайсин 9, Тупий 10)                            | +2  | +   |     |     | +3  |     |     | -1  | 3      | 447   | 3     |
| 003 | Школа №30 (Васенин 9, Великоредчанин 9, Гурьев 8)                   | +   | +   |     |     |     |     |     |     | 2      | 115   | 4     |
| 009 | КФМЛ #1 (Ашихмин 6, Шутов 6, Бурков 6)                              |     | +1  |     |     | +1  | -1  |     |     | 2      | 133   | 5     |
| 006 | Лицей №9 г.Слободского, "Девятка" (Касимов 8, Шиврин 8, Демин 8)    |     | +   | -3  |     | +1  |     |     |     | 2      | 235   | 6     |
| 017 | Школа №28 #3 (Лагунова 10, Ошуркова 10, Ситников 10)                |     | +1  | -1  | -2  | +   | -2  |     |     | 2      | 270   | 7     |
| 008 | КФМЛ, "Секрет" (Прищепа 7, Порошина 7)                              | +   |     |     |     | +   |     |     |     | 2      | 315   | 8     |
| 013 | КФМЛ #5 (Шатров 7, Михайлов 7, Коротаев 7)                          | +   |     |     |     |     |     |     |     | 1      | 38    | 9     |
| 007 | Школа №65 (Караваев 7, Пресс 7, Бородин 7)                          | +   |     |     |     | -5  |     |     |     | 1      | 63    | 10    |
| 011 | КФМЛ #3 (Даровских 7, Жолобов 7, Орефков 7)                         |     |     |     |     | +1  | -2  |     |     | 1      | 120   | 11    |
| 014 | КФМЛ #6 (Дружинин 7, Чернобровкин 7, Бердников 7)                   | +   |     |     |     | -1  | -1  |     |     | 1      | 123   | 12    |
| 002 | КЭПЛ #2 (Перминов 9, Фуфачев 9, Чащин 9)                            |     | +2  |     |     |     |     |     |     | 1      | 148   | 13    |
| 010 | КФМЛ #2 (Евтухов 6, Корольков 6, Лучинин 6)                         |     |     |     |     | +8  |     |     |     | 1      | 328   | 14    |
| 004 | Школа №60 (Беликов 10, Ислибаев 11, Парамонов 11)                   |     |     |     |     |     |     |     |     | 0      | 0     | 15    |
| 012 | КФМЛ #4 (Никишов 7, Павлов 7, Ушаков 7)                             |     |     |     |     | -2  | -10 |     |     | 0      | 0     | 15    |
| 015 | КФМЛ #7 (Типун 7, Мариев 7)                                         | -1  | -1  |     |     | -1  | -2  |     |     | 0      | 0     | 15    |
| 016 | Школа №28 #2 (Бородавкин 10, Михолап 10, Волкоморов 10)             | -2  | -2  |     |     | -5  | -4  |     |     | 0      | 0     | 15    |
|-----+---------------------------------------------------------------------+-----+-----+-----+-----+-----+-----+-----+-----+--------+-------+-------|

** Материалы

+ [[./2013-statements.pdf][Условия задач]]
+ [[./2013-solutions.pdf][Разбор задач]]
+ [[./2013-runs.7z][Архив подходов участников]]
+ [[http://informatics.mccme.ru/moodle/mod/statements/view.php?id%3D7672][Дорешивание]]

** Место проведения

КОГОАУ «Кировский физико-математический лицей», г. Киров, ул. Труда 16.

** Расписание

*28 апреля:*

+ 10:00 - 10:30 :: открытие, объяснение правил
+ 10:30 - 11:00 :: пробный тур для знакомства с техникой и проверяющей системой
+ 11:15 - 14:15 :: cоревнование
+ 14:30 :: подведение итогов


** Контакты

Пестов Олег Александрович, +7(909)143-5774, ~oleg.pestov@gmail.com~.

{{{end-block}}}
