bricks/olymp/olymp/arhimed/2013.html
<div class="Page">






<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Турнир Архимеда 2013 в Кирове</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>28 апреля 2013 года</b> состоится Турнир Архимеда - международная
командная олимпиада по программированию для начинающих. Это командное
соревнование, которое проводится в один компьютерный тур
продолжительностью 3 часа. Команде из трёх человек предоставляется
один персональный компьютер и предлагается решить 8-12 задач. Для
решения задач участники могут использовать следующие языки
программирования: C/C++, C#, Java, Pascal, Python.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Правила олимпиады</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Турнир проходит по правилам написанным на <a href="http://arhimedes.org/index.php?id=informatics">официальном сайте</a>. Основные моменты:
</p>

<ul class="org-ul">
<li>команде предоставляется компьютер с установленными средами и
компиляторами, а также с доступом к проверяющей системе, условия
нескольких задач и три часа времени
</li>
<li>решение задачи - программа на одном из разрешённых языков
программирования
</li>
<li>решения проверяются автоматически
</li>
<li>побеждает команда, решившая больше всего задач
</li>
<li>во время тура участники взаимодействуют только со своей командой и с
жюри
</li>
<li>разрешается использовать любую литературу
</li>
<li>не разрешается использовать технику, за исключением предоставляемого
компьютера
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Результаты</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Турнир Архимеда 2013 в Кирове состоялся. Cпасибо всем за участие. Наши результаты:
</p>

<table>


<colgroup>
<col  class="right">

<col  class="left">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">
</colgroup>
<thead>
<tr>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">Команда</th>
<th scope="col" class="center">A</th>
<th scope="col" class="center">B</th>
<th scope="col" class="center">C</th>
<th scope="col" class="center">D</th>
<th scope="col" class="center">E</th>
<th scope="col" class="center">F</th>
<th scope="col" class="center">G</th>
<th scope="col" class="center">H</th>
<th scope="col" class="center">Задачи</th>
<th scope="col" class="center">Баллы</th>
<th scope="col" class="center">Место</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">018</td>
<td class="left">Школа №28 #4 (Черемисинова 9, Голощапова 9)</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center">-4</td>
<td class="center"> </td>
<td class="center">+</td>
<td class="center">-2</td>
<td class="center">-3</td>
<td class="center"> </td>
<td class="center">3</td>
<td class="center">138</td>
<td class="center">1</td>
</tr>

<tr>
<td class="right">005</td>
<td class="left">ЦДООШ + Школа №10, "Вадим и К.О." (Радаев 9, Пиксаев 9, Щербаков 9)</td>
<td class="center">+</td>
<td class="center">+3</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">+1</td>
<td class="center">-7</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">3</td>
<td class="center">308</td>
<td class="center">2</td>
</tr>

<tr>
<td class="right">001</td>
<td class="left">КЭПЛ #1 (Фролова 10, Кайсин 9, Тупий 10)</td>
<td class="center">+2</td>
<td class="center">+</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">+3</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">-1</td>
<td class="center">3</td>
<td class="center">447</td>
<td class="center">3</td>
</tr>

<tr>
<td class="right">003</td>
<td class="left">Школа №30 (Васенин 9, Великоредчанин 9, Гурьев 8)</td>
<td class="center">+</td>
<td class="center">+</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">115</td>
<td class="center">4</td>
</tr>

<tr>
<td class="right">009</td>
<td class="left">КФМЛ #1 (Ашихмин 6, Шутов 6, Бурков 6)</td>
<td class="center"> </td>
<td class="center">+1</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">+1</td>
<td class="center">-1</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">133</td>
<td class="center">5</td>
</tr>

<tr>
<td class="right">006</td>
<td class="left">Лицей №9 г.Слободского, "Девятка" (Касимов 8, Шиврин 8, Демин 8)</td>
<td class="center"> </td>
<td class="center">+</td>
<td class="center">-3</td>
<td class="center"> </td>
<td class="center">+1</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">235</td>
<td class="center">6</td>
</tr>

<tr>
<td class="right">017</td>
<td class="left">Школа №28 #3 (Лагунова 10, Ошуркова 10, Ситников 10)</td>
<td class="center"> </td>
<td class="center">+1</td>
<td class="center">-1</td>
<td class="center">-2</td>
<td class="center">+</td>
<td class="center">-2</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">270</td>
<td class="center">7</td>
</tr>

<tr>
<td class="right">008</td>
<td class="left">КФМЛ, "Секрет" (Прищепа 7, Порошина 7)</td>
<td class="center">+</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">+</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="center">315</td>
<td class="center">8</td>
</tr>

<tr>
<td class="right">013</td>
<td class="left">КФМЛ #5 (Шатров 7, Михайлов 7, Коротаев 7)</td>
<td class="center">+</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">38</td>
<td class="center">9</td>
</tr>

<tr>
<td class="right">007</td>
<td class="left">Школа №65 (Караваев 7, Пресс 7, Бородин 7)</td>
<td class="center">+</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">-5</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">63</td>
<td class="center">10</td>
</tr>

<tr>
<td class="right">011</td>
<td class="left">КФМЛ #3 (Даровских 7, Жолобов 7, Орефков 7)</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">+1</td>
<td class="center">-2</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">120</td>
<td class="center">11</td>
</tr>

<tr>
<td class="right">014</td>
<td class="left">КФМЛ #6 (Дружинин 7, Чернобровкин 7, Бердников 7)</td>
<td class="center">+</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">-1</td>
<td class="center">-1</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">123</td>
<td class="center">12</td>
</tr>

<tr>
<td class="right">002</td>
<td class="left">КЭПЛ #2 (Перминов 9, Фуфачев 9, Чащин 9)</td>
<td class="center"> </td>
<td class="center">+2</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">148</td>
<td class="center">13</td>
</tr>

<tr>
<td class="right">010</td>
<td class="left">КФМЛ #2 (Евтухов 6, Корольков 6, Лучинин 6)</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">+8</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="center">328</td>
<td class="center">14</td>
</tr>

<tr>
<td class="right">004</td>
<td class="left">Школа №60 (Беликов 10, Ислибаев 11, Парамонов 11)</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">0</td>
<td class="center">0</td>
<td class="center">15</td>
</tr>

<tr>
<td class="right">012</td>
<td class="left">КФМЛ #4 (Никишов 7, Павлов 7, Ушаков 7)</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">-2</td>
<td class="center">-10</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">0</td>
<td class="center">0</td>
<td class="center">15</td>
</tr>

<tr>
<td class="right">015</td>
<td class="left">КФМЛ #7 (Типун 7, Мариев 7)</td>
<td class="center">-1</td>
<td class="center">-1</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">-1</td>
<td class="center">-2</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">0</td>
<td class="center">0</td>
<td class="center">15</td>
</tr>

<tr>
<td class="right">016</td>
<td class="left">Школа №28 #2 (Бородавкин 10, Михолап 10, Волкоморов 10)</td>
<td class="center">-2</td>
<td class="center">-2</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">-5</td>
<td class="center">-4</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">0</td>
<td class="center">0</td>
<td class="center">15</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Материалы</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="./2013-statements.pdf">Условия задач</a>
</li>
<li><a href="./2013-solutions.pdf">Разбор задач</a>
</li>
<li><a href="./2013-runs.7z">Архив подходов участников</a>
</li>
<li><a href="http://informatics.mccme.ru/moodle/mod/statements/view.php?id=7672">Дорешивание</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Место проведения</h3>
<div class="outline-text-3" id="text-1-4">
<p>
КОГОАУ «Кировский физико-математический лицей», г. Киров, ул. Труда 16.
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Расписание</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<b>28 апреля:</b>
</p>

<dl class="org-dl">
<dt> 10:00 - 10:30 </dt><dd>открытие, объяснение правил
</dd>
<dt> 10:30 - 11:00 </dt><dd>пробный тур для знакомства с техникой и проверяющей системой
</dd>
<dt> 11:15 - 14:15 </dt><dd>cоревнование
</dd>
<dt> 14:30 </dt><dd>подведение итогов
</dd>
</dl>
</div>
</div>


<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Контакты</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Пестов Олег Александрович, +7(909)143-5774, <code>oleg.pestov@gmail.com</code>.
</p>

</div>
</div>
</div>
</div>
